---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamGasViscosity
source: html/81942498-e0f2-c412-3ec0-2f312f57a0df.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ThermalMaterialParamGasViscosity Property

"Gas Viscosity"

## Syntax (C#)
```csharp
public static ForgeTypeId ThermalMaterialParamGasViscosity { get; }
```